[
    {
        "id": "CISC108",
        "name": "Introduction to Computer Science I",
        "description": "Computing and principles of programming with an emphasis on systematic program design. Topics include functional programming, data abstraction, procedural abstraction, use of control and state, recursion, testing, and object-oriented programming concepts. Requires no prior programming experience, open to any major, but intended primarily for majors and minors in computer science or mathematics.",
        "credits": 3,
        "prereqs": ""
    },
    {
        "id": "CISC181",
        "name": "Introduction to Computer Science II",
        "description": "Principles of computer science illustrated and applied through programming in an object oriented language. Programming projects illustrate computational problems, styles and issues that arise in computer systems development and in all application areas of computation.",
        "credits": 3,
        "prereqs": "CISC108"
    },
    {
        "id": "CISC210",
        "name": "Introduction to Systems Programming",
        "description": "Principles of computer systems programming for software and hardware platforms to achieve efficient resource usage. Topics include the C programming language, memory management, and awareness of system constraints and interfacing. Projects include programming embedded systems and interactive objects.",
        "credits": 3,
        "prereqs": "CISC108"
    },
    {
        "id": "CISC220",
        "name": "Data Structures",
        "description": "Review of data type abstraction, recursion, arrays, stacks, queues, multiple stacks and linked lists. Emphasis on dynamic storage management, garbage collection, trees, graphs, tables, sorting and searching.",
        "credits": 3,
        "prereqs": "CISC210"
    },
    {
        "id": "CISC260",
        "name": "Machine Organization and Assembly Language",
        "description": "Introduction to the basics of machine organization. Programming tools and techniques at the machine and assembly levels. Assembly language programming and computer arithmetic techniques.",
        "credits": 3,
        "prereqs": ""
    },
    {
        "id": "CISC275",
        "name": "Introduction to Software Engineering",
        "description": "Object oriented software design and development through use of an object oriented programming language. Topics include team programming, design patterns, graphical user interfaces, software engineering tools (e.g., integrated development environments, version control, build management, bug tracking, automated testing).",
        "credits": 3,
        "prereqs": ""
    },
    {
        "id": "CISC303",
        "name": "Automata Theory",
        "description": "Automata and formal language theory. Background for advanced applications in compilers, computer networks, operating systems, and natural language processing. Finite automata and regular languages. Push down automata and context free grammars. Turing machines.",
        "credits": 3,
        "prereqs": ""
    },
    {
        "id": "CISC320",
        "name": "Introduction to Algorithms",
        "description": "Design and analysis of algorithms: worst/average case analysis, proofs for correctness and performance of algorithms. Algorithmic strategies (divide and conquer, greedy methods, dynamic programming, etc.). Algorithms for searching, forming and traversal of strings, trees and graphs. Categorization of computational problems: classes P and NP. NP completeness.",
        "credits": 3,
        "prereqs": ""
    },
    {
        "id": "CISC361",
        "name": "Operating Systems",
        "description": "Principles and techniques employed in the development of operating systems and their control programs. Includes management of memory, processors, I/O devices.",
        "credits": 3,
        "prereqs": ""
    },
    {
        "id": "CISC372",
        "name": "Parallel Computing",
        "description": "Introduction to parallel computing concepts, methodologies, and tools. Programming and algorithmic techniques for code that will run simultaneously on parallel computing architectures. Topics include: single and multi-core parallelism, shared and distributed memory architectures, concurrency, program decomposition, data distribution, communication, load balancing, scalability, locality, granularity, debugging, performance evaluation.",
        "credits": 3,
        "prereqs": ""
    },
    {
        "id": "MATH210",
        "name": "Discrete Mathematics I",
        "description": "Elements of sets and logic. Relations, functions. Integers. Induction and recursion. Principles and techniques of counting. Graphs. Paths and circuits",
        "credits": 3,
        "prereqs": ""
    },
    {
        "id": "MATH241",
        "name": "Analytic Geometry and Calculus A",
        "description": "Functions, limits, continuity, derivatives. Polynomial, rational, exponential, hyperbolic, logarithmic, trigonometric and inverse trigonometric functions. Definite and indefinite integrals and the Fundamental Theorem of Calculus. Simple differential equations (separable ODE, linear ODE). ODE models leading to exponential growth and decay.",
        "credits": 4,
        "prereqs": ""
    },
    {
        "id": "MATH242",
        "name": "Analytic Geometry and Calculus B",
        "description": "Brief review of MATH 241; evaluation of limits by L’Hospital’s rule; applications of integration; integration techniques; parametric curves; polar coordinates; infinite sequences and series. Includes use of computers to perform symbolic, numerical and graphical analysis.",
        "credits": 4,
        "prereqs": ""
    },
    {
        "id": "MATH205",
        "name": "Statistical Methods",
        "description": "Descriptive statistics, graphical displays, sampling, variation, normal distribution, estimation, hypothesis testing, one-way analysis of variance, simple linear regression and goodness of fit. Laboratory covers use of statistical packages on mainframe and microcomputers.",
        "credits": 4,
        "prereqs": ""
    },
    {
        "id": "MATH350",
        "name": "Probability Theory and Simulation Methods",
        "description": "Introduces the basic theory of discrete and continuous aspects of probability theory. Topics include bivariate distributions, sums of independent random variables, moment generating functions, laws of large numbers and central limit theorem.",
        "credits": 3,
        "prereqs": ""
    },
    {
        "id": "CISC355",
        "name": "Computers, Ethics, and Society",
        "description": "Explains relationships among information technology, society and ethics by examining issues raised by increasingly widespread use of computers. Topics include ethics for computer professionals, computer impact on factory work, office work, personal privacy and social power distribution.",
        "credits": 3,
        "prereqs": ""
    },
    {
        "id": "ENGL312",
        "name": "Written Communications in Business",
        "description": "Examines the role of written communication in corporate decision making. Students write memos, letters, proposals and reports that simulate on-the-job communication tasks, and are encouraged to use materials from their fields of specialization.",
        "credits": 3,
        "prereqs": ""
    },
    {
        "id": "ENGL410",
        "name": "Technical Writing",
        "description": "Selected problems in technical communications, the preparation of reports and technical editing.",
        "credits": 3,
        "prereqs": ""
    },
    {
        "id": "CISC304",
        "name": "Logic for Programming",
        "description": "Propositional and predicate logic for general reasoning and advanced applications in knowledge representation in artificial intelligence and database, program correctness and programming semantics. Models, resolution, logic programming, and natural deduction.",
        "credits": 3,
        "prereqs": ""
    },
    {
        "id": "MATH349",
        "name": "Elementary Linear Algebra",
        "description": "Systems of linear equations, linear combinations of vectors, and matrix algebra. Determinants, eigenvalues and eigenvectors, similarity and diagonalization of square matrices. Vector spaces, linear dependence and independence, basis and dimension, linear transformations. Inner product spaces, orthogonality, orthogonal projections, fundamental subspaces. A software package may be used for the analysis and solution of linear algebra problems.",
        "credits": 3,
        "prereqs": ""
    },
    {
        "id": "CISC498",
        "name": "Computer Science Senior Design Project I",
        "description": "First semester of two-semester senior software design course.  Students work in teams to develop solutions to real-world problems for a client.  Application of a modern software engineering process; requirement solicitation, analysis, and specification; prototyping; design; incremental development; testing and verification; client interaction; and presentation. Offered in Fall only.",
        "credits": 3,
        "prereqs": ""
    },
    {
        "id": "CISC499",
        "name": "Computer Science Senior Design Project II",
        "description": "Continuation of CISC498",
        "credits": 3,
        "prereqs": ""
    }
]